Revit 2027 API
FabricationPart.LiningArea Property
 The lining area of the fabrication part. If the fabrication part is not lined, returns zero.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double LiningArea { get; }
Public ReadOnly Property LiningArea As Double
	Get
public:
property double LiningArea {
	double get ();
}
member LiningArea : float with get
Property Value
Double
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace